logs/sysbench/old/20190521_2_1/thread_rw2_20190521212847.log
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 2 tps: 119.75 qps: 1916.59 (r/w/o: 1197.99/479.00/239.60) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 154.49 qps: 2473.49 (r/w/o: 1546.13/618.27/309.09) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 160.11 qps: 2560.22 (r/w/o: 1599.88/640.13/320.22) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 86.60 qps: 1387.40 (r/w/o: 867.40/346.80/173.20) lat (ms,95%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 111.20 qps: 1778.69 (r/w/o: 1111.50/444.80/222.40) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 2 tps: 114.70 qps: 1834.28 (r/w/o: 1146.59/458.40/229.30) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            74700
        write:                           29880
        other:                           14940
        total:                           119520
    transactions:                        7470   (124.48 per sec.)
    queries:                             119520 (1991.70 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0048s
    total number of events:              7470

Latency (ms):
         min:                                  3.57
         avg:                                 16.06
         max:                                126.46
         95th percentile:                     42.61
         sum:                             119976.46

Threads fairness:
    events (avg/stddev):           3735.0000/65.00
    execution time (avg/stddev):   59.9882/0.00